html-report/statistics.json
{
  "GET Target URL" : {
    "transaction" : "GET Target URL",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 610.6,
    "medianResTime" : 402.0,
    "minResTime" : 265.0,
    "maxResTime" : 1612.0,
    "pct1ResTime" : 1586.3000000000002,
    "pct2ResTime" : 1612.0,
    "pct3ResTime" : 1612.0,
    "throughput" : 4.894762604013705,
    "receivedKBytesPerSec" : 383.7895405041605,
    "sentKBytesPerSec" : 1.2141305677924619
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 610.6,
    "medianResTime" : 402.0,
    "minResTime" : 265.0,
    "maxResTime" : 1612.0,
    "pct1ResTime" : 1586.3000000000002,
    "pct2ResTime" : 1612.0,
    "pct3ResTime" : 1612.0,
    "throughput" : 4.894762604013705,
    "receivedKBytesPerSec" : 383.7895405041605,
    "sentKBytesPerSec" : 1.2141305677924619
  }
}