reports/jmeter-execution.log
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using D:\Mohan\play-wright\temp\jmeter-runtime\jmeter-b24a17e9-a410-4943-b4a7-050196e961d0.jmx
Starting standalone test @ 2026 Jun 17 12:43:40 IST (1781680420054)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary =     10 in 00:00:02 =    4.4/s Avg:   610 Min:   265 Max:  1612 Err:     0 (0.00%)
Tidying up ...    @ 2026 Jun 17 12:43:42 IST (1781680422657)
... end of run